TexasInstruments/mcupsdk-core-k3/test/drivers/i2c/am62ax-sk/a53ss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62Ax" --part "Default" --package "AMB" --context "a53ss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM62A7-Q1" --package "FCBGA (AMB)" --variant "AM62A74-M" --context "a53ss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.24.0+4150"}
 */

/**
 * Import the modules used in this configuration.
 */
const i2c        = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1       = i2c.addInstance();
const i2c2       = i2c.addInstance();
const i2c3       = i2c.addInstance();
const i2c4       = i2c.addInstance();
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mmu_armv8  = scripting.addModule("/kernel/dpl/mmu_armv8", {}, false);
const mmu_armv81 = mmu_armv8.addInstance();
const mmu_armv82 = mmu_armv8.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
i2c1.$name           = "CONFIG_I2C0";
i2c1.I2C.$assign     = "I2C0";
i2c1.I2C_child.$name = "drivers_i2c_v0_i2c_v0_template0";

i2c2.$name           = "CONFIG_I2C2";
i2c2.I2C.$assign     = "I2C1";
i2c2.I2C_child.$name = "drivers_i2c_v0_i2c_v0_template2";

i2c3.$name                   = "CONFIG_I2C1";
i2c3.useMcuDomainPeripherals = true;
i2c3.advanced                = true;
i2c3.ownTargetAddr2          = 0x10;
i2c3.ownTargetAddr3          = 0x10;
i2c3.ownTargetAddr4          = 0x10;
i2c3.ownTargetAddr1          = 0x10;
i2c3.I2C_child.$name         = "drivers_i2c_v0_i2c_v0_template1";

i2c4.$name           = "CONFIG_I2C3";
i2c4.I2C_child.$name = "drivers_i2c_v0_i2c_v0_template3";

debug_log.enableUartLog        = true;
debug_log.uartLog.$name        = "CONFIG_UART_CONSOLE";
debug_log.uartLog.UART.$assign = "USART0";

mmu_armv81.size  = 0x80000000;
mmu_armv81.$name = "SOC_MEM_REGION";

mmu_armv82.vAddr     = 0x80000000;
mmu_armv82.pAddr     = 0x80000000;
mmu_armv82.size      = 0x80000000;
mmu_armv82.attribute = "MAIR7";
mmu_armv82.$name     = "DDR_REGION";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
i2c1.I2C.SCL.$suggestSolution               = "I2C0_SCL";
i2c1.I2C.SDA.$suggestSolution               = "I2C0_SDA";
i2c2.I2C.SCL.$suggestSolution               = "I2C1_SCL";
i2c2.I2C.SDA.$suggestSolution               = "I2C1_SDA";
i2c3.MCU_I2C.$suggestSolution               = "MCU_I2C0";
i2c3.MCU_I2C.SCL.$suggestSolution           = "MCU_I2C0_SCL";
i2c3.MCU_I2C.SDA.$suggestSolution           = "MCU_I2C0_SDA";
i2c4.I2C.$suggestSolution                   = "I2C2";
i2c4.I2C.SCL.$suggestSolution               = "GPMC0_CSn2";
i2c4.I2C.SDA.$suggestSolution               = "GPMC0_CSn3";
debug_log.uartLog.UART.RXD.$suggestSolution = "UART0_RXD";
debug_log.uartLog.UART.TXD.$suggestSolution = "UART0_TXD";
